Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c2779c70-a371-41a2-94d6-ba33da6e2a60">
  <name>РасчетыСПоставщиками</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <dimensions extendedConfigurationObject="9d355ffe-61ea-4616-b69f-2e44b1264030">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Extensions/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Аванс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Долг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb5f6678-4158-4ee5-8fcb-5d1c6c1cc651">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Extensions/src/Catalogs/AzRyКонтрольОстатковПараметры/AzRyКонтрольОстатковПараметры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>AzRyКонтрольОстатковПараметры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Активный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Extensions/src/CommonModules/УправлениеНебольшойФирмойСервер/Module.bsl
&Вместо("НалогообложениеНДС")
Функция РасшAzRy_НалогообложениеНДС(Организация, Склад = Неопределено, Дата, Контрагент = Неопределено, Договор = Неопределено, ПолюбомуОблагать = ЛОЖЬ)
	
	//Паганини_
	//Запрос = Новый Запрос;
	//
	//Если ЗначениеЗаполнено(Дата) Тогда
	//	Запрос.УстановитьПараметр("Дата",Дата);
	//Иначе
	//	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("Склад", Склад);
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС) КАК НалогообложениеНДС
	//|ИЗ
	//|	РегистрСведений.ПримененияЕНВД.СрезПоследних(
	//|			&Дата,
	//|			Организация = &Организация
	//|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияЕНВД
	//|ГДЕ
	//|	ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	//|ИЗ
	//|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	//|ГДЕ
	//|	Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)";
	//
	//НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	//
	//Выборка = запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	НалогообложениеНДС = Выборка.НалогообложениеНДС;
	//КонецЕсли;

//	Если ЗначениеЗаполнено(Контрагент) Тогда
//		Если Организация.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
//			Если НЕ Договор = Неопределено И Договор.УчитыватьНДФЛ Тогда
//				НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
//			Иначе
//				СтруктураСреза = РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(Дата, Новый Структура("Контрагент,Договор", Контрагент, Договор));
//				Если НЕ ЗначениеЗаполнено(СтруктураСреза.НалогообложениеНДС) Тогда 
//					НалогообложениеНДС = ?(ЗначениеЗаполнено(Контрагент.НалогообложениеНДС), Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
//				Иначе
//					НалогообложениеНДС = СтруктураСреза.НалогообложениеНДС;
//				КонецЕсли;
//			КонецЕсли;
//		Иначе
//			НалогообложениеНДС = Организация.НалогообложениеНДС;
//		КонецЕсли;
//	Иначе
//		НалогообложениеНДС = ?(ЗначениеЗаполнено(Организация.НалогообложениеНДС), Организация.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
//	КонецЕсли;

	Если ЗначениеЗаполнено(Контрагент) И Контрагент.НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.НаЭкспорт И ПолюбомуОблагать Тогда 
		Возврат Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	КонецЕсли;
	
	ДанныеОрганизации = Организация;
	Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияОрганизации") Тогда 
		ДанныеОрганизации = РегистрыСведений.НалогообложениеОрганизации.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если Контрагент.НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда //+++ Дмгг
		Если ДанныеОрганизации.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
			Если НЕ Договор = Неопределено И Договор.УчитыватьНДФЛ И Не Контрагент.ЯвляетсяНеРезидентом Тогда
			// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
				НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
			Иначе
				ДанныеКонтрагента = Контрагент;
				Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда  
					ДанныеКонтрагента = РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(Дата, Новый Структура("Контрагент,Договор", Контрагент, Договор));
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеКонтрагента.НалогообложениеНДС) 
					И Контрагент.ЯвляетсяНеРезидентом
					И Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда 
					
					НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт;
					
				ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеКонтрагента.НалогообложениеНДС) Тогда 
					НалогообложениеНДС = ?(ЗначениеЗаполнено(Контрагент.НалогообложениеНДС) , Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
				Иначе
					НалогообложениеНДС = ДанныеКонтрагента.НалогообложениеНДС;
				КонецЕсли;
			КонецЕсли;
		Иначе
			НалогообложениеНДС = ДанныеОрганизации.НалогообложениеНДС;
		КонецЕсли;
		//+++ Дмгг
		Иначе
			НалогообложениеНДС =  Перечисления.ТипыНалогообложенияНДС.НаЭкспорт;
		КонецЕсли;
		//--- Дмгг 
	Иначе
		НалогообложениеНДС = ?(ЗначениеЗаполнено(ДанныеОрганизации.НалогообложениеНДС), ДанныеОрганизации.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	КонецЕсли;

	//_Паганини
	
	Возврат НалогообложениеНДС;
	
КонецФункции

&Вместо("ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл")
Функция РасшAzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ЭтоВозвратПоставщика = Ложь)
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПоставщиками");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		Если ЭтоВозвратПоставщика Тогда 
			
			НомерЗапроса = 3;
			
			ТекстЗапроса =
						
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Документ КАК Документ,
			|	ВложенныйЗапрос.ДокументВалютаДокумента КАК ДокументВалютаДокумента,
			|	ВложенныйЗапрос.ДокументДата КАК ДокументДата,
			|	ВложенныйЗапрос.Курс КАК Курс,
			|	ВложенныйЗапрос.Кратность КАК Кратность
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовДокументовРасчета
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств КАК ДокументВалютаДокумента,
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата КАК ДокументДата,
			|		КурсыВалют.Курс КАК Курс,
			|		КурсыВалют.Кратность КАК Кратность
			|	ИЗ
			|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				КурсыВалют.Валюта КАК Валюта,
			|				МАКСИМУМ(КурсыВалют.Период) КАК Период,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата КАК ДокументДата,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств КАК ДокументВалютаДокумента
			|			ИЗ
			|				ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|					ПО ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств = КурсыВалют.Валюта
			|						И ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата >= КурсыВалют.Период
			|			
			|			СГРУППИРОВАТЬ ПО
			|				КурсыВалют.Валюта,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств) КАК ВложенныйЗапрос
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|				ПО ВложенныйЗапрос.Валюта = КурсыВалют.Валюта
			|					И ВложенныйЗапрос.Период = КурсыВалют.Период
			|			ПО ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств = ВложенныйЗапрос.Валюта) КАК ВложенныйЗапрос
			// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Документ,
			|	ВложенныйЗапрос.ДокументВалютаДокумента,
			|	ВложенныйЗапрос.ДокументДата,
			|	ВложенныйЗапрос.Курс,
			|	ВложенныйЗапрос.Кратность
			// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად			
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыОстатки.Организация КАК Организация,
			|	РасчетыОстатки.Контрагент КАК Контрагент,
			|	РасчетыОстатки.Договор КАК Договор,
			|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
			|	РасчетыОстатки.Документ КАК Документ,
			|	РасчетыОстатки.Заказ КАК Заказ,
			|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
			|	КОНЕЦ КАК СчетУчета,
			|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
			|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
			|	СУММА(РасчетыОстатки.СуммаДокумента) КАК СуммаДокумента,
			|	СУММА(РасчетыОстатки.СуммаВал) КАК СуммаРасчетов,
			|	СУММА(РасчетыОстатки.Курс) КАК Курс,
			|	РасчетыОстатки.Кратность КАК Кратность
			|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
			|ИЗ
			|	(ВЫБРАТЬ
			|		1 КАК Порядок,
			|		ВременнаяТаблица.Организация КАК Организация,
			|		ВременнаяТаблица.Контрагент КАК Контрагент,
			|		ВременнаяТаблица.Договор КАК Договор,
			|		ВременнаяТаблица.Документ КАК Документ,
			|		ВременнаяТаблица.Заказ КАК Заказ,
			|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
			|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
			|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток,
			|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаДокумента,
			|		ВременнаяТаблица.СуммаВал КАК СуммаВал,
			|		-КурсыВалютБанковскогоСчета.Курс КАК Курс,
			|		КурсыВалютБанковскогоСчета.Кратность КАК Кратность
			|	ИЗ
			|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютБанковскогоСчета
			|			ПО ВременнаяТаблица.ВалютаДенежныхСредств = КурсыВалютБанковскогоСчета.Валюта
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2,
			|		ТаблицаОстатки.Организация,
			|		ТаблицаОстатки.Контрагент,
			|		ТаблицаОстатки.Договор,
			|		ТаблицаОстатки.Документ,
			|		ТаблицаОстатки.Заказ,
			|		ТаблицаОстатки.ТипРасчетов,
			|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
			|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
			|		0,
			|		0,
			|		ВременнаяТаблицаКурсовДокументовРасчета.Курс,
			|		ВременнаяТаблицаКурсовДокументовРасчета.Кратность
			|	ИЗ
			|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
			|				&МоментВремени2,
			|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
			|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсовДокументовРасчета КАК ВременнаяТаблицаКурсовДокументовРасчета
			|			ПО ТаблицаОстатки.Документ = ВременнаяТаблицаКурсовДокументовРасчета.Документ
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
			|			ПО ТаблицаОстатки.Документ = ВременнаяТаблица.Документ
			|				И ТаблицаОстатки.Документ = ВременнаяТаблица.Документ
			|				И ТаблицаОстатки.Организация = ВременнаяТаблица.Организация
			|				И ТаблицаОстатки.Контрагент = ВременнаяТаблица.Контрагент
			|				И ТаблицаОстатки.Заказ = ВременнаяТаблица.Заказ
			|				И ТаблицаОстатки.ТипРасчетов = ВременнаяТаблица.ТипРасчетов) КАК РасчетыОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыОстатки.Кратность,
			|	РасчетыОстатки.Организация,
			|	РасчетыОстатки.Контрагент,
			|	РасчетыОстатки.Договор,
			|	РасчетыОстатки.Документ,
			|	РасчетыОстатки.Заказ,
			|	РасчетыОстатки.ТипРасчетов,
			|	РасчетыОстатки.Договор.ВалютаРасчетов,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
			|	КОНЕЦ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация,
			|	Контрагент,
			|	Договор,
			|	ВалютаРасчетов,
			|	Документ,
			|	Заказ,
			|	ТипРасчетов,
			|	СчетУчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	1 КАК НомерСтроки,
			|	&ПериодКонтроля КАК Дата,
			|	ТаблицаРасчеты.Организация КАК Организация,
			|	ТаблицаРасчеты.Контрагент КАК Контрагент,
			|	ТаблицаРасчеты.Договор КАК Договор,
			|	ТаблицаРасчеты.Документ КАК Документ,
			|	ТаблицаРасчеты.Заказ КАК Заказ,
			|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
			|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницыСтарая,
			|	ТаблицаРасчеты.Валюта КАК Валюта,
			|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
			|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [6 мая 2023]  НАЧАЛО
			//|	ТаблицаОстатки.СуммаРасчетов * ТаблицаОстатки.Курс КАК СуммаКурсовойРазницы//КурсоваяРазница
			|	ТаблицаОстатки.СуммаРасчетов * ТаблицаОстатки.Курс / ТаблицаОстатки.Кратность КАК СуммаКурсовойРазницы//КурсоваяРазница
			// © Шишка В.В. [6 мая 2023]  КОНЕЦ
			//--------------------------------------------------------------------------
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
			|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
			|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
			|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
			|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
			|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
			|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
			|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
			|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ
			|						КонстантаВалютаУчета.Значение
			|					ИЗ
			|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|ГДЕ
			//|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) //ONESOFT-4141 
			|	ТаблицаРасчеты.ТипРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
			|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
			|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	1 КАК Порядок,
			|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
			|	ТаблицаДокумента.Дата КАК Период,
			|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.Контрагент КАК Контрагент,
			|	ТаблицаДокумента.Договор КАК Договор,
			|	ТаблицаДокумента.Документ КАК Документ,
			|	ТаблицаДокумента.Заказ КАК Заказ,
			|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
			|	ТаблицаДокумента.Сумма КАК Сумма,
			|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
			|	ТаблицаДокумента.СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	ТаблицаДокумента.СодержаниеПроводки,
			|	0 КАК КурсоваяРазницв
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	2,
			|	ТаблицаДокумента.НомерСтроки,
			|	ТаблицаДокумента.Дата,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	КОНЕЦ,
			|	ТаблицаДокумента.Организация,
			|	ТаблицаДокумента.Контрагент,
			|	ТаблицаДокумента.Договор,
			|	ТаблицаДокумента.Документ,
			|	ТаблицаДокумента.Заказ,
			|	ТаблицаДокумента.ТипРасчетов,
			//|	ВЫБОР
			//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			//|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			|	КОНЕЦ,
			//|	ТаблицаДокумента.СуммаКурсовойРазницы, //КурсоваяРазница,
			|	0,
			|	ТаблицаДокумента.СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	&КурсоваяРазница,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			|	КОНЕЦ
			//|	ТаблицаДокумента.СуммаКурсовойРазницы //КурсоваяРазница
			|ИЗ
			|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл КАК ТаблицаДокумента
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок,
			|	НомерСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	3 КАК Поле1,
			|	ДвиженияДокумента.Организация,
			|	ДвиженияДокумента.Контрагент,
			|	ДвиженияДокумента.Договор,
			|	ДвиженияДокумента.Документ,
			|	ДвиженияДокумента.Заказ,
			|	ДвиженияДокумента.ТипРасчетов,
			|	ВЫБОР
			|		КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
			|	КОНЕЦ КАК Поле2,
			|	ВЫБОР
			|		КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|	КОНЕЦ КАК Поле3,
			|	0 КАК Поле4,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0) / ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|	КОНЕЦ КАК Поле5,
			|	ВременнаяТаблицаКурсовДокументовРасчета.Курс,
			|	ВременнаяТаблицаКурсовДокументовРасчета.Кратность
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсовДокументовРасчета КАК ВременнаяТаблицаКурсовДокументовРасчета
			|		ПО ДвиженияДокумента.Документ = ВременнаяТаблицаКурсовДокументовРасчета.Документ
			|ГДЕ
			|	ДвиженияДокумента.Регистратор = &Ссылка
			|	И ДвиженияДокумента.Период <= &ПериодКонтроля";
			
		Иначе
			
			НомерЗапроса = 1;
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	1 КАК НомерСтроки,
			|	&ПериодКонтроля КАК Дата,
			|	ТаблицаРасчеты.Организация КАК Организация,
			|	ТаблицаРасчеты.Контрагент КАК Контрагент,
			|	ТаблицаРасчеты.Договор КАК Договор,
			|	ТаблицаРасчеты.Документ КАК Документ,
			|	ТаблицаРасчеты.Заказ КАК Заказ,
			|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
			|	0 КАК СуммаКурсовойРазницы,
			|	ТаблицаРасчеты.Валюта КАК Валюта,
			|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
			|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
			|ГДЕ
			|	ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.Дата КАК Период,
			|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.Контрагент КАК Контрагент,
			|	ТаблицаДокумента.Договор КАК Договор,
			|	ТаблицаДокумента.Документ КАК Документ,
			|	ТаблицаДокумента.Заказ КАК Заказ,
			|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
			|	ТаблицаДокумента.Сумма КАК Сумма,
			|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
			|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	ТаблицаДокумента.СодержаниеПроводки
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокумента.СодержаниеПроводки,
			|	Документ,
			|	Заказ,
			|	ВидДвижения";
			
		КонецЕсли;
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор.ВалютаРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПоставщикомРегл,
		// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: ძველი გადმოტანილი დოკუმენტებისთვის საკურსო სხვაობის დასაფიქსირფებლად
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ВыполнитьКонтрольОстатков")
Функция РасшAzRy_ВыполнитьКонтрольОстатков()
	
	// +++ { AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	Если Константы.КонтролироватьОстаткиПриПроведении.Получить()
		ИЛИ ВыполнитьКонтрольОстатковПоПроектам() //Малышев 2024-06-11 ONESOFT-3094	
		Тогда  // GM_Check_TODO
		Возврат Истина;
	Иначе 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	AzRyКонтрольОстатковПараметры.Организации КАК Организации
		|ИЗ
		|Справочник.AzRyКонтрольОстатковПараметры КАК AzRyКонтрольОстатковПараметры
		|
		|ГДЕ
		|	AzRyКонтрольОстатковПараметры.ПометкаУдаления = ЛОЖЬ
		|	И AzRyКонтрольОстатковПараметры.Активный = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока Из РезультатЗапроса Цикл
			Если ЗначениеЗаполнено(ПараметрыСеанса.AzRyОрганиация) Тогда 
				Если ТекСтрока.Организации = ПараметрыСеанса.AzRyОрганиация Тогда	
					Возврат Истина;		
				КонецЕсли; 
			КонецЕсли;			
		КонецЦикла;	
	КонецЕсли; 
	
	Возврат Ложь;
	// +++ } AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	
КонецФункции

&После("ИнициализироватьДополнительныеСвойстваДляПроведения")
Процедура РасшAzRy_ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// +++ { AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	ПараметрыСеанса.AzRyОрганиация = СтруктураДополнительныеСвойства.ДляПроведения.Организация;
	// +++ } AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	
КонецПроцедуры

&Вместо("ПодготовкаДанныхДляОтправкиВЕГАИС")
Функция РасшAzRy_ПодготовкаДанныхДляОтправкиВЕГАИС(ДокументОбъект, ДанныеЕГАИСДостаточны)

	ТаблицаТовары = ДокументОбъект.Запасы.Выгрузить();
	ТаблицаАкцизы = ДокументОбъект.АкцизныеМарки.Выгрузить();
	
	ПродажаСПроверкойЕГАИС = ИспользуетсяРегистрацияРозничныхПродажВЕГАИС();
	
	Если ТаблицаТовары.Колонки.Найти("ПроцентАвтоматическойСкидки") = Неопределено Тогда
		ТаблицаТовары.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число"));
		ТаблицаТовары.Колонки.Добавить("СуммаАвтоматическойСкидки", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Характеристика,
	|	ТаблицаДокумента.Партия,
	|	ТаблицаДокумента.Количество,
	|	ТаблицаДокумента.ЕдиницаИзмерения,
	|	ТаблицаДокумента.Цена,
	|	ТаблицаДокумента.ПроцентСкидкиНаценки,
	|	ТаблицаДокумента.Сумма,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.СуммаНДС,
	|	ТаблицаДокумента.Всего,
	|	ТаблицаДокумента.ПроцентАвтоматическойСкидки,
	|	ТаблицаДокумента.СуммаАвтоматическойСкидки,
	|	ТаблицаДокумента.КлючСвязи,
	|	ТаблицаДокумента.НеобходимостьВводаАкцизнойМарки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Партия,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Всего,
	|	ТаблицаТовары.ПроцентАвтоматическойСкидки,
	|	ТаблицаТовары.ЕдиницаИзмерения,
	|	ТаблицаТовары.КлючСвязи,
	|	ТаблицаТовары.СуммаАвтоматическойСкидки,
	|	ТаблицаТовары.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
	|	ТаблицаТовары.Номенклатура.ВидАлкогольнойПродукции.Маркируемый КАК Маркируемый,
	|	ТаблицаТовары.Номенклатура.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Номенклатура.Крепость КАК Крепость,
	|	ТаблицаТовары.Номенклатура.ВидАлкогольнойПродукции.Код КАК КодВидаПродукции,
	|	ТаблицаТовары.Всего,
	|	ТаблицаТовары.НеобходимостьВводаАкцизнойМарки
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМАкцизныеМарки.НомерСтроки,
	|	ЧекККМАкцизныеМарки.КлючСвязи,
	|	ЧекККМАкцизныеМарки.КодАкцизнойМарки
	|ПОМЕСТИТЬ ТаблицаАкцизныхМарок
	|ИЗ
	|	&ТаблицаАкцизы КАК ЧекККМАкцизныеМарки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Партия,
	|	ТаблицаТовары.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТаблицаШтрихкоды
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ТаблицаТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ТаблицаТовары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|			И ТаблицаТовары.Партия = ШтрихкодыНоменклатуры.Партия
	|			И (ТИПЗНАЧЕНИЯ(ТаблицаТовары.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ИЛИ ТаблицаТовары.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Партия,
	|	ТаблицаТовары.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Партия,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Всего,
	|	ТаблицаТовары.ПроцентАвтоматическойСкидки,
	|	ТаблицаТовары.ЕдиницаИзмерения,
	|	ТаблицаТовары.КлючСвязи,
	|	ТаблицаТовары.СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТовары.Маркируемый
	|							И НЕ ТаблицаАкцизныхМарок.КодАкцизнойМарки ЕСТЬ NULL 
	|						ТОГДА ТаблицаАкцизныхМарок.КодАкцизнойМарки
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КодАкцизнойМарки,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ТаблицаТовары.Маркируемый
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркируемый,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|				И ТаблицаТовары.АлкогольнаяПродукция
	|			ТОГДА ТаблицаТовары.ОбъемДАЛ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемДАЛ,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|				И ТаблицаТовары.АлкогольнаяПродукция
	|			ТОГДА ТаблицаТовары.Крепость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Крепость,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ТаблицаТовары.АлкогольнаяПродукция
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АлкогольнаяПродукция,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|				И ТаблицаТовары.АлкогольнаяПродукция
	|			ТОГДА ТаблицаТовары.КодВидаПродукции
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодВидаПродукции,
	|	ТаблицаШтрихкоды.Штрихкод
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаАкцизныхМарок КАК ТаблицаАкцизныхМарок
	|		ПО ТаблицаТовары.КлючСвязи = ТаблицаАкцизныхМарок.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
	|		ПО ТаблицаТовары.Номенклатура = ТаблицаШтрихкоды.Номенклатура
	|			И ТаблицаТовары.Характеристика = ТаблицаШтрихкоды.Характеристика
	|			И ТаблицаТовары.Партия = ТаблицаШтрихкоды.Партия";
	
	Запрос.УстановитьПараметр("ПродажаСПроверкойЕГАИС", ПродажаСПроверкойЕГАИС);
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	Запрос.УстановитьПараметр("ТаблицаАкцизы", ТаблицаАкцизы);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаТоваровЧека = Результат.Выгрузить();
	
	Если ПродажаСПроверкойЕГАИС Тогда
		ДанныеЕГАИСДостаточны = ДанныеЕГАИСДостаточны(ТаблицаТоваровЧека, ДокументОбъект);
	КонецЕсли;
	
	// Подготовка таблицы товаров
	ТаблицаТоваров = Новый Массив();
	
	Для каждого СтрокаТЧ Из ТаблицаТоваровЧека Цикл
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТЧ.СтавкаНДС);
		
		СтрокаТаблицыТоваров = Новый СписокЗначений();
		НаименованиеТовара = Строка(СтрокаТЧ.Номенклатура) + ?(ЗначениеЗаполнено(СтрокаТЧ.Характеристика), " (" + Строка(СтрокаТЧ.Характеристика) + ")", "");
		СтрокаТаблицыТоваров.Добавить(НаименованиеТовара);    //  1 - Наименование
		СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Штрихкод);     //  2 - Штрихкод
		СтрокаТаблицыТоваров.Добавить("");                    //  3 - Артикул
		СтрокаТаблицыТоваров.Добавить(1);                     //  4 - Номер отдела
		СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Цена + ?(ДокументОбъект.СуммаВключаетНДС, 0, СтрокаТЧ.СуммаНДС / ?(СтрокаТЧ.Количество = 0, 1, СтрокаТЧ.Количество))); //  5 - Цена за позицию без скидки
		СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Количество);   //  6 - Количество
		СтрокаТаблицыТоваров.Добавить("");                    //  7 - Наименование скидки/наценки
		СтрокаТаблицыТоваров.Добавить(0);                     //  8 - Сумма скидки/наценки
		СтрокаТаблицыТоваров.Добавить(0);                     //  9 - Процент скидки/наценки
		СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Всего);        // 10 - Сумма позиции со скидкой
		СтрокаТаблицыТоваров.Добавить(0);                     // 11 - Номер налога (1)
		СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.СуммаНДС);     // 12 - Сумма налога (1)
		СтрокаТаблицыТоваров.Добавить(СтавкаНДС);             // 13 - Процент налога (1)
		СтрокаТаблицыТоваров.Добавить(0);                     // 14 - Номер налога (2)
		СтрокаТаблицыТоваров.Добавить(0);                     // 15 - Сумма налога (2)
		СтрокаТаблицыТоваров.Добавить(0);                     // 16 - Процент налога (2)
		СтрокаТаблицыТоваров.Добавить("");                    // 17 - Наименование секции форматирования товарной строки
		
		#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		//ПараметрыАлкогольнойПродукции = ИнтеграцияЕГАИСУНФ.ПараметрыАлкогольнойПродукции(СтрокаТЧ);;
		//СтрокаТаблицыТоваров.Добавить(ПараметрыАлкогольнойПродукции); // 18 - Параметры алкогольной продукции
		СтрокаТаблицыТоваров.Добавить(Новый Массив); // 18 - Параметры алкогольной продукции
		#КонецЕсли
		
		ТаблицаТоваров.Добавить(СтрокаТаблицыТоваров);
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ЗаписатьВерсиюОбъекта(Источник, Отказ) Экспорт
	
	Если РольДоступна("AzRyЗапретНаСозданиеНоменклатуры") И Источник.ЭтоНовый() Тогда
		Отказ = Истина;
		СообщитьОбОшибке(Источник, "თქვენს მომხმარებელს აკრძალული აქვს ახალი ნომენკლატურის შექმნა!");
	КонецЕсли; 
	
КонецПроцедуры
